results/postgresql_sysbench_read_gpt_5_5/restore_verify_20260521_sysbench.log

$ sysbench /usr/share/sysbench/oltp_read_only.lua --db-driver=pgsql --threads=64 --time=60 run
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 64
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 64 tps: 5887.38 qps: 94323.79 (r/w/o: 82537.24/0.00/11786.55) lat (ms,95%): 15.83 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 64 tps: 6300.25 qps: 100804.57 (r/w/o: 88203.08/0.00/12601.50) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 64 tps: 6389.79 qps: 102222.59 (r/w/o: 89443.82/0.00/12778.77) lat (ms,95%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 64 tps: 6419.21 qps: 102722.16 (r/w/o: 89883.74/0.00/12838.42) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 64 tps: 6437.61 qps: 102990.77 (r/w/o: 90114.95/0.00/12875.82) lat (ms,95%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 64 tps: 6431.20 qps: 102908.98 (r/w/o: 90046.98/0.00/12862.00) lat (ms,95%): 13.95 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 64 tps: 6444.68 qps: 103124.70 (r/w/o: 90235.34/0.00/12889.36) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 6440.72 qps: 103035.94 (r/w/o: 90154.49/0.00/12881.44) lat (ms,95%): 13.95 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 64 tps: 6446.20 qps: 103159.01 (r/w/o: 90266.01/0.00/12893.00) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 64 tps: 6436.40 qps: 102970.32 (r/w/o: 90097.93/0.00/12872.39) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 64 tps: 6438.00 qps: 103005.64 (r/w/o: 90129.23/0.00/12876.40) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 6421.12 qps: 102727.34 (r/w/o: 89885.50/0.00/12841.84) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            5355392
        write:                           0
        other:                           765056
        total:                           6120448
    transactions:                        382528 (6372.08 per sec.)
    queries:                             6120448 (101953.32 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0315s
    total number of events:              382528

Latency (ms):
         min:                                    1.66
         avg:                                   10.04
         max:                                   27.11
         95th percentile:                       13.70
         sum:                              3839784.21

Threads fairness:
    events (avg/stddev):           5977.0000/145.89
    execution time (avg/stddev):   59.9966/0.01